% Εφαρμογή της μεθόδου των δυνάμεων για την προσέγγιση της 
% μεγαλύτερης κατά μέτρο ιδιοτιμής και του αντίστοιχου ιδιοδιανύσματος του πίνακα Α
clear


A=[-2 -2 3; -10 -1 6; 10 -2 -9];
n=3;nn=3; 
[n nn]=size(A);

y=[1 0 0]';
nz=1;n1=3;
[n1 nz]=size(y);

maxiter=100;
tol=0.13;  %1e-8;

if (n~=nn)
    disp('Λάθος της μεθόδου δυνάμεων: Ο πίνακας Α πρέπει να είναι τετραγωνικός');return;
elseif (n~=n1)
    disp('Λάθος της μεθόδου δυνάμεων: οι διαστάσεις του πίνακα Α και του διανύσματος y δεν είναι συμβατές');return;
end;

%Έλεγχος ιδιοτιμών
idiotimes=eig(A);
% disp('idiotimes tou A'); disp(idiotimes);


% προσέγγιση της μεγαλύτερης κατά μέτρο ιδιοτιμής και του αντίστοιχου
% ιδιοδιανύσματος
[lambda_max,zmax] = eig_power(A,y,tol,maxiter)

